modm-ext/data.modm.io/docs/svd/header_stm32f378xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM16">
      <name>TIM17</name>
      <description>TIM</description>
      <baseAddress>0x40014800</baseAddress>
      <interrupt>
        <name>TIM17</name>
        <description>TIM17 global Interrupt</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIM3">
      <name>TIM19</name>
      <description>TIM</description>
      <baseAddress>0x40015c00</baseAddress>
      <interrupt>
        <name>TIM19</name>
        <description>TIM19 global Interrupt</description>
        <value>78</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SDADC1</name>
      <description>Sigma-Delta Analog to Digital Converter (SDADC)</description>
      <baseAddress>0x40016000</baseAddress>
      <interrupt>
        <name>SDADC1</name>
        <description>ADC Sigma Delta 1 global Interrupt</description>
        <value>61</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>SDADC control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EOCALIE</name>
              <description>End of calibration interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOCIE</name>
              <description>Injected end of conversion interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JOVRIE</name>
              <description>Injected data overrun interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REOCIE</name>
              <description>Regular end of conversion interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVRIE</name>
              <description>Regular data overrun interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REFV</name>
              <description>Reference voltage selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SLOWCK</name>
              <description>Slow clock mode enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBI</name>
              <description>Enter standby mode when idle</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDI</name>
              <description>Enter power down mode when idle</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JSYNC</name>
              <description>Launch a injected conversion synchronously with SDADC1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSYNC</name>
              <description>Launch regular conversion synchronously with SDADC1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JDMAEN</name>
              <description>DMA channel enabled to read data for the injected channel group</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDMAEN</name>
              <description>DMA channel enabled to read data for the regular channel</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT</name>
              <description>Initialization mode request</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>SDADC control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADON</name>
              <description>SDADC enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALIBCNT</name>
              <description>Number of calibration sequences to be performed</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>STARTCALIB</name>
              <description>Start calibration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JCONT</name>
              <description>Continuous mode selection for injected conversions</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JDS</name>
              <description>Delay start of injected conversions</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEXTSEL</name>
              <description>Trigger signal selection for launching injected conversions</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>JEXTEN</name>
              <description>Trigger enable and trigger edge selection for injected conversions</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>JSWSTART</name>
              <description>Start a conversion of the injected group of channels</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCH</name>
              <description>Regular channel selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RCONT</name>
              <description>Continuous mode selection for regular conversions</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSWSTART</name>
              <description>Software start of a conversion on the regular channel</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAST</name>
              <description>Fast conversion mode selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>SDADC interrupt and status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EOCALF</name>
              <description>End of calibration flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JEOCF</name>
              <description>End of injected conversion flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JOVRF</name>
              <description>Injected conversion overrun flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REOCF</name>
              <description>End of regular conversion flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROVRF</name>
              <description>Regular conversion overrun flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CALIBIP</name>
              <description>Calibration in progress status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JCIP</name>
              <description>Injected conversion in progress status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCIP</name>
              <description>Regular conversion in progress status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STABIP</name>
              <description>Stabilization in progress status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INITRDY</name>
              <description>Initialization mode is ready</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLRISR</name>
          <description>SDADC clear interrupt and status register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>JCHGR</name>
          <description>SDADC injected channel group selection register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JCHG</name>
              <description>Injected channel group selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF0R</name>
          <description>SDADC configuration 0 register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET0</name>
              <description>12-bit calibration offset for configuration 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>GAIN0</name>
              <description>Gain setting for configuration 0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SE0</name>
              <description>Single ended mode for configuration 0</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMMON0</name>
              <description>Common mode for configuration 0</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF1R</name>
          <description>SDADC configuration 1 register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET1</name>
              <description>12-bit calibration offset for configuration 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>GAIN1</name>
              <description>Gain setting for configuration 1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SE1</name>
              <description>Single ended mode for configuration 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMMON1</name>
              <description>Common mode for configuration 1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF2R</name>
          <description>SDADC configuration 2 register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET2</name>
              <description>12-bit calibration offset for configuration 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>GAIN2</name>
              <description>Gain setting for configuration 2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SE2</name>
              <description>Single ended mode for configuration 2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMMON2</name>
              <description>Common mode for configuration 2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFCHR1</name>
          <description>SDADC channel configuration register 1</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CONFCH0</name>
              <description>Channel 0 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CONFCH1</name>
              <description>Channel 1 configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CONFCH2</name>
              <description>Channel 2 configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CONFCH3</name>
              <description>Channel 3 configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CONFCH4</name>
              <description>Channel 4 configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CONFCH5</name>
              <description>Channel 5 configuration</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CONFCH6</name>
              <description>Channel 6 configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CONFCH7</name>
              <description>Channel 7 configuration</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFCHR2</name>
          <description>SDADC channel configuration register 2</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CONFCH8</name>
              <description>Channel 8 configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDATAR</name>
          <description>SDADC data register for injected group</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected group conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>JDATACH</name>
              <description>Injected channel most recently converted</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATAR</name>
          <description>SDADC data register for the regular channel</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDATA</name>
              <description>Injected group conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDATA12R</name>
          <description>SDADC1 and SDADC2 injected data register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA1</name>
              <description>Injected group conversion data for SDADC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>JDATA2</name>
              <description>Injected group conversion data for SDADC2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATA12R</name>
          <description>SDADC1 and SDADC2 regular data register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDATA1</name>
              <description>Regular conversion data for SDADC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RDATA2</name>
              <description>Regular conversion data for SDADC2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDATA13R</name>
          <description>SDADC1 and SDADC3 injected data register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA1</name>
              <description>Injected group conversion data for SDADC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>JDATA3</name>
              <description>Injected group conversion data for SDADC3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RDATA13R</name>
          <description>SDADC1 and SDADC3 regular data register</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RDATA1</name>
              <description>Regular conversion data for SDADC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RDATA3</name>
              <description>Regular conversion data for SDADC3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
